/*****************************************************************************
*  File name:MorseCode
*  Project name: 代号X特工的秘密—摩尔斯电码破译
*  Platform info:Code Composer Studio V7.3.0.00019
*  Function:通过敲击按键S1，判断“滴”“嗒”信号，并进行解析，最终把明码（或电文）显示在墨水屏幕中。
*  敲击一次按键S1表示短促的点信号“·”，读“滴”（Di），按键S1按下后保持一定时间表示长信号“—”，读“嗒”（Da）。
*
*  Author:颜泽宏，刘璞，刘夏越
*  Student ID:SZ160210104, SZ160210105, SZ160210106
*  Version: Vx.x
*  Date：Aug，25,2018
*  Description:
*----------------------------------------------------------------------------*
*  Change History:                                                           *
*  <Date>     | <Version> | <Author>       | <Description>                   *
*----------------------------------------------------------------------------*
*  2018/07/23 | 1.0       | 刘璞                                           | 模块初始化，IO操作以及按键敲击读取函数readkey*
*----------------------------------------------------------------------------*
*  2018/07/24 | 1.1       | 刘璞                                           | 按键时长细致化修改，结合LED亮灭可视化按键输入       *
*----------------------------------------------------------------------------*
*  2018/07/26 | 2.0       | 刘夏越                                       | 加入二十六个英文字母字典、decode解码函数，完善电子墨水屏显示*
*----------------------------------------------------------------------------*
*  2018/08/02 | 2.1       | 刘夏越                                       | 加入串口，与用户进行交互，加入send_buf内容        *
*----------------------------------------------------------------------------*
*  2018/08/06 | 2.2       | 刘夏越                                       | 进一步完善decode返回的电码明文在电子墨水屏和串口数据传输界面的显示*
*----------------------------------------------------------------------------*
*  2018/08/25 | 3.0       | 颜泽宏                                       | 编辑注释                                                                                              *
*----------------------------------------------------------------------------*
*  2018/08/26 | 3.1       | 颜泽宏，刘夏越                     | 完善摩尔斯电码表数字和符号部分，修改解码数组上限位数为6位，修改readkey, decode两个主要函数等*
*----------------------------------------------------------------------------*
*  2018/08/27 | 3.2       | 颜泽宏，刘夏越                     | Debug，检验关键数组在程序运行过程中的实际数值是否与预期相符，解决部分电码无法显示的问题*
*----------------------------------------------------------------------------*
*                                                                            *
******************************************************************************/

/****************************头文件声明*********************************/
#include <msp430f5529.h> 
#include <readMorse.h>
#include <Paper_Display.h>

/****************************宏定义和变量********************************/
#define Nsentence 20    //定义句子最大长度
#define TimesNewRoman 0
#define Arial 1
volatile unsigned char DisBuffer[250*16];   //电子墨水屏显示缓存大小为250*16



/*****************************main函数********************************/
/**
 * @brief main.c
 * 首先对各模块进行初始化
 * 通过串口通信与用户交互
 * 根据按键S1的敲击，判断“滴”“嗒”信号，并进行解析，最终把明码（或电文）显示在墨水屏幕中。
 */
int main(void)
{
	WDTCTL = WDTPW | WDTHOLD;	// stop watchdog timer

	//调用各模块初始化函数
	initClock();
    PaperIO_Int();
    INIT_SSD1673();
    Init_buff();
    DIS_IMG(2); //以文字形式通过DIS_IMG（）函数写入缓存
	initTB();
	initIO();
	initUart();

	//定义变量
	volatile int *p; //定义整形指针p
	volatile int i=0,j=0;
	volatile int sindex=0; //句子数组的索引
	volatile int word[6] = {2,2,2,2,2,2};
	unsigned char sentence[Nsentence]={0};
	unsigned char temp[2]={'\0','\0'};

	//通过串口输出数据
	send_buf("Hello! \r\n");
	send_buf("Use S1 to input your Morse code \r");
	send_buf("Use S2 to input show the whole sentence \r\n");

	while(1)
	{
	    //S1按下,记录摩尔斯电码并解码
	    if(!(P1IN&BIT2))
		{
			clcLight(); //关闭所有LED灯指示
			p = readKey(); //指针p指向readKey()返回的整形数组code
			for (i=0;i<6;i++)
			{
			word[i] = *(p+i); //将指针p指向的值对应地赋给word数组
			}
			showMorse(word[0],word[1],word[2],word[3],word[4],word[5]); //将译码用LED灯展示，亮灯对应表示长按信号Da所在的位数
			temp[0]=decode(word);
			sentence[sindex]=temp[0];
			send_buf(temp); //串口即时输出，可以连接电脑，用串口调试助手查看
			sindex++;
			while(!(P1IN&BIT2));
		}
	    // S2按下,输出整个句子
		if(!(P1IN&BIT3))
		{
		    //电子墨水屏输出
            Init_buff(); //缓存区清零
            display(sentence, 20, 36,TimesNewRoman, size16, 0, 1); //将破译出的摩尔斯电码显示到电子墨水屏上
            DIS_IMG(1); //把缓存区内容写到屏幕上
            //串口输出
            send_buf(" \r\n Your input is : ");
            sentence[sindex]='\n';
            send_buf(sentence); //将无符号字符型数组sentence传入send_buf函数进行输出
		    for(j=0;j<Nsentence;j++)
		    {
                sentence[j]=0; //clear
		    }
            delay(100);
		}
	} //while(1)循环
	return 0;
}
